#### WoodPoreType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "AdvancedLayered" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum WoodPoreType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WoodPoreType ``` |

| Visual C++ |
| --- |
| ``` public enum class WoodPoreType ``` |

# Members

| Member name | Description |
| --- | --- |
| InBothWoods |  |
| EarlywoodOnly |  |
| LatewoodOnly |  |

# See Also

Autodesk.Revit.DB.Visual Namespace